# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 80 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

ch: 4

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Silence, []],  # 0-P1/2
    [0, 1, SilenceChannel, [3,0]],  # 0-P1/2
    [-1, 1, Conv, [64, 3, 2]],
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, C3, [128]],
    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 6, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 9, C3, [512]],
    [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
    [-1, 3, C3, [1024]],

    [0, 1, SilenceChannel, [4, 3]],  # 0-P1/2
    [-1, 1, Conv, [64, 3, 2]],
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, C3, [128]],
    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 6, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 9, C3, [512]],
    [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
    [-1, 3, C3, [1024]],

    [[6, 16], 1, Concat, [1]],  # cat backbone P3   21
    [[8, 18], 1, Concat, [1]],  # cat backbone P4   22
    [[10, 20], 1, Concat, [1]],  # cat backbone P4    23
    [23, 1, SPPF, [1024, 5]], 
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 22], 1, Concat, [1]], # cat backbone P4
    [-1, 3, C3, [512, False]], # 13

    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 21], 1, Concat, [1]], # cat backbone P3
    [-1, 3, C3, [256, False]], # 17 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 27], 1, Concat, [1]], # cat head P4
    [-1, 3, C3, [512, False]], # 20 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 24], 1, Concat, [1]], # cat head P5
    [-1, 3, C3, [1024, False]], # 23 (P5/32-large)

    [[30, 33, 36], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]
